---
type: StructuralSectionConcreteRound
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 1
tags: [revit-api, class]
---

# StructuralSectionConcreteRound

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteRound` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionConcreteRound | 2016 | `public StructuralSectionConcreteRound ( double diameter , double centroidHorizontal , double centroidVertical , double principalAxesAngle , double sectionArea , double perimeter , double nominalWeight , double momentOfIn` |